package com.nswlab; // бегом писать код начни с токен тайп знаю
import java.io.IOException; // апрув пж надо файлы делать а фулл доступа нет я их создать не могу (еще директории нада) gotovo

public final class Main {

    public static void main(String[] args) throws IOException {

    }
}

/* Задачи
* 1. Переделать AST👍
* 2. Сделать Бекенд компилятора в JVM😊
* 3. Сделать первую рабочую версию😍
* 4. Поменять интерфейсы👍 если что яп
* 5. Сделать Lib os💖
   Задачи */

// !TODO вынести задачи на гитхаб.
// Я пойду сделаю лексер и токены👍
// сейчас с нуля пишем яп😊